src/pages.org
#+title: wmedrano.dev Pages
#+author: Will Medrano
#+hugo_base_dir: ./..
#+hugo_section: ./

* Drafts
:PROPERTIES:
:EXPORT_TITLE: Drafts
:EXPORT_FILE_NAME: drafts
:EXPORT_DATE: 2023-04-22
:END:

This page contains ideas for possible future posts.

** Rust Essential Libraries/Functionality

The libraries or functionality I use in most Rust projects.
- logging
- command line flags
- easy parallelism (rayon)
- CI with building, testing, linting, and releasing.

These are also useful in some contexts:

- performance monitoring

** Takeaways from Watching Game Devlogs

- Solo/SmallTeam developers have a wide variety of skills.
- With varying levels of mastery for each of those skills.
- Some very focused, some not so much.

Some skills I noticed:

- Artistic vision (atmosphere, visual, audio, music)
- Programming: Execution, quality and optimization
- Game design
- Project management

** Tour of My Mechanical Keyboards

I have

- Keyboardio Model 01 and Keyboardio Model 100
- Ergodox EZ
- ZSA Moonlander
- Preonic - The only non-split, but still ortholinear keyboard.
- Iris

My current daily driver is the Iris.
