content/drafts.md
+++
title = "Drafts"
author = ["Will Medrano"]
date = 2023-04-22
lastmod = 2023-04-22T23:12:21-07:00
draft = false
+++

This page contains ideas for possible future posts.


## Rust Essential Libraries/Functionality {#rust-essential-libraries-functionality}

The libraries or functionality I use in most Rust projects.

-   logging
-   command line flags
-   easy parallelism (rayon)
-   CI with building, testing, linting, and releasing.

These are also useful in some contexts:

-   performance monitoring


## Takeaways from Watching Game Devlogs {#takeaways-from-watching-game-devlogs}

-   Solo/SmallTeam developers have a wide variety of skills.
-   With varying levels of mastery for each of those skills.
-   Some very focused, some not so much.

Some skills I noticed:

-   Artistic vision (atmosphere, visual, audio, music)
-   Programming: Execution, quality and optimization
-   Game design
-   Project management


## Tour of My Mechanical Keyboards {#tour-of-my-mechanical-keyboards}

I have

-   Keyboardio Model 01 and Keyboardio Model 100
-   Ergodox EZ
-   ZSA Moonlander
-   Preonic - The only non-split, but still ortholinear keyboard.
-   Iris

My current daily driver is the Iris.
